/**
 * author: YooYoungKeun

 * Date: 2025-03-04
 
 * Desc: 250304 Practice
 */

package practice;

public class P_250304_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		/* 프로그램 정의 : 
		 * 일의 진행 계획이나 순서.
		 */
		
		/* 프로그램 실행의 의미 : 
		 * 여러 프로그램 언어로 쓰인 프로그램을 기계어로 번역하여, 프로그램을 주 기억 장치 내로 배정하고 그 처리 시작 주소에서
		 * 연속 명령을 실행하는 것. 프로그램 실행을 위해서는 명령의 인출, 주소연산, 피연산자의 해석, 명령부호의 실행 등
		 * 여러 가지 중앙 처리 장치 동작이 실행된다.
		 */
		
		/* 컴퓨터 프로그램의 정의 : 
		 * 컴퓨터에서 실행 될 때 특정 작업을 수행하는 일련의 명령어들의 모음(집합).
		 * 특정 문제를 해결하기 위해 처리 방법과 순서를 기술하여 컴퓨터에 입력되는 일련의 명령문 집합체이며
		 * 대부분의 프로그램은 실행 중 (명령어를 불러들일때) 사용자의 입력에 반응하도록 구현된 일련의 명령어들로 구성되어 있다.
		 * 대부분의 프로그램들은 하드디크스 등의 매체에 바이너리(2진법) 형식의 파일로 저장되어 있다가 사용자가 실행시키면 메모리로
		 * 적재되어 실행된다. 컴퓨터 소프트웨어와 비슷한 뜻을 가지고 있다. 
		 */
		
		/* 프로그램 언어 정의 :
		 * 컴퓨터에게 명령이나 연산을 시킬 목적으로 설계되어 기계와(컴퓨터) 의사소통을 할 수 있게 해주는 언어 
		 */
		
		/* 소프트웨어 정의 :
		 * 프로그램을 비롯해 개발과정에서 생성되는 모든 산출물과 각 단계에서 만들어지는 문서와 사용자 메뉴얼 등 
		 * (프로그램 + 각종 문서들 및 사용자 메뉴얼)
		 * (운영체제, 프로그램, 애플리케이션, 게임 등) 무형의 디지털 컴퓨터를 설명하는 일종의 포괄적 용어
		 */
		
		/* 코드란? :
		 * 특정 프로그래밍 언어로 작성된 컴퓨 프로그램의 사람이 읽을 수 있는 형태 
		 */
		
		/* 코딩이란 :
		 * 프로그램에서 작업을 수행하기 위해 사용되는 언어로 컴퓨터에게 명령하는 것
		 */
		
		/* 프로그래머 란? :
		 * 컴퓨터 프로그래밍을 하는 사람. 컴퓨터 프로그램의 논리나 알고리즘을 설계하고 프로그램을 작성하고 테스트 한다.
		 */
		
		/* 하드웨어 란?
		 * 컴퓨터를 구성하는 필수 요소 중 하나. 컴퓨터 내부에 있는 물리적 부품
		 * (그래픽카드, 프로세서, 마더보드, 메모리, 팬, cpu 쿨러 등)
		 */
		
		/* 고급언어 : 
		 * 컴퓨터와 대화할 수 있도록 만든 언어 중에서 사람이 쉽게 이해할 수 있는 언어
		 * 저급언어 : 
		 * 컴퓨터가 직접 이해하고 실행할 수 있는 언어
		 */
		
		/* 컴파일 정의 : 
		 * 어떤 언어의 코드 전체를 다른 언어로 바꿔주는 과정
		 * 컴파일러 정의 :
		 * 컴파일을 자동으로 수행해주는 소프트웨어
		 */ 
		
		/* 버그 란? : 
		 * 소프트웨어가 예상하지 못한 잘못된 결과를 내거나, 오류가 발생하거나, 착오나 오작동이 발생하는 등의 문제.
		 * 프로그램의 소스 코드나 설계 과정에서의 결점, 결함 및 오류 때문에 발생한다.
		 */
		
		/* 디버그, 디버깅 이란? : 
		 * 버그를 찾아내고 그 원인을 수정하는 작업을 디버그라 하고
		 * 그 과정을 디버깅이라 한다.
		 */
			 

	}

}
