package practice;

public class P_250304_12 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		
		/*변수 이름 지을 때 유의사항 6가지 
		 * 1.첫번째 글자가 문자여야한다.
		 * 2.자바의 경우 변수이름 정할 시 데이터 타입을 고려해야 한다.
		 * 3.변수 이름 중간에 특수문자는 _ 와 $ 만 사용가능
		 * 4.약속어는 사용할 수 없음
		 * 5.작은따옴표('')로 감싸는 문자 리터럴은 유니코드로 변환되어 저장되고 고유의 값이 숫자로 매핑되어있다.
		 * 6.타입변환시 자동 타입변환은 허용범위가 작은 값이 허용범위가 큰 값으로 대입될 때 자동 발생하지만
		 * 강제 타입변환은 허용범위가 큰 값이 허용범위가 작은값에 강제 대입할 경우 대입하고자하는 큰 타입앞에 대입당하고자하는
		 * 작은타입을 괄호치고 기재해준다.
		 * ex) int intValue = 10 ;
		 * 	   byte bytevalue = (byte) intvalue;  
		 * 
		 * 
		 * 
		 * 관용적으로 지켜야 할 것들 4가지
		 *1. 변수이름에 한글을 포함하지 않는다
		 *2. 첫글자 소문자
		 *3. 카멜방식
		 *4. 변수이름은 길어도 상관이 없지만 쉽게 알 수 있도록 의미 있는 이름을 지어준다.
		 * 
		 */
		
		
		/* = , += , % 연산자에 대해서 설명 해 주세요
		 * 단순 대입 연산자 (=) : 우측 값을 좌측 변수에 저장하는 연산자
		 * 복합 대입 연산자 (+=) : 우측 값을 좌측 변수의 값과 더한 후에 다시 변수에 저장하는 연산자
		 * 산술 연산자 (%) : 나눗셈의 나머지를 산출하는 연산자
		 */
		
		/*++전위,후위 연산자에 대해서 설명 해 주세요
		 * ex )int i = 5; 일때
		 *  i++ ); 는 i의 값을 적용하고 세미클론을 지난 후 i의 값이 증가(선 적용 후 증가)
		 *  ++i ); 는 i의 값에 +1 증가시킨 후 그 값을 적용 (선 증가 후 적용)
		 */ 


		/*순서도를 보고 자바 코드로 구현해 주세요.P()는 println의 의미
		 * 59,60번 문제
		 */

//		int a=6;
//		a=a+3;
//		System.out.println(a);		
		//예상출력 9
		
		/**순서도에서 psudo code는 잘 모르겠습니다. 
		 * 
		 */
		 
		 
		 
	}

}
